
```

```

#**B.Manipulasi Data Dengan Apache Spark SQL**
#**[SELECT & FUNCTION Statment ]**

##**1. Hadoop & PySpark initialization di Google Colab**

*PySpark* adalah *interface Python* untuk *Apache Spark*. Penggunaan utama *PySpark* adalah untuk bekerja dengan data dalam Bigdata dan untuk membuat pipeline data.

Walaupun *Apache Spark* mendudukung Big Data, sebagai awal pembelajaran tidak perlu menggunakan data yang besar untuk mendapatkan manfaat dari PySpark. Kita bisa temukan bahwa SparkSQL adalah tools yang bagus untuk melakukan analisis data. Penggunaan library Panda menjadi lambat dengan data yang besar Sumber tentang Apache Spark http://spark.apache.org/docs/latest/api/python/

In [ ]:
#Init Hadoop & Spark
#=====Begin

#=====End

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/ms_produk.csv?raw=true"

Dengan perintah - perintah SQL berikut pada platform Apache Spark SQL

#**2. Manipulasi Data Dengan SELECT Statment**
##**2.1. Mengambil Seluruh Kolom dalam suatu Tabel**


```
   select * from ms_produk;
```

In [ ]:
select * from ms_produk;

##**2.2. Mengambil Satu Kolom dari Tabel**

In [ ]:
select nama_produk from ms_produk;

## **2.3. Mengambil Lebih dari Satu Kolom dari Tabel**
```
   SELECT nama_produk, harga FROM ms_produk;
```

In [ ]:
SELECT nama_produk, harga FROM ms_produk;

##**2.4. Membatasi Pengambilan Jumlah Row Data**

```
  SELECT nama_produk, harga FROM ms_produk LIMIT 5;
```

In [ ]:
SELECT nama_produk, harga FROM ms_produk LIMIT 5;

##**2.5 Penggunaan SELECT DISTINCT statement**

Lakukan manipulasi data dari dataset pada tautan berikut:
"https://github.com/rahmadsa/dataset/blob/main/spark/ms_penggan.csv"
dengan query sebagai berikut.

```
SELECT DISTINCT nama_customer, alamat FROM ms_pelanggan;
```

In [ ]:
SELECT DISTINCT nama_customer, alamat FROM ms_pelanggan;

##**2.6. Menggunakan Prefix pada Nama Kolom**

```
SELECT ms_produk.kode_produk FROM ms_Produk;
```
Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/ms_produk.csv"
dengan query sebagai berikut.

In [ ]:
SELECT ms_produk.kode_produk FROM ms_Produk;

##**2.7. Menggunakan Alias pada Kolom**

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/ms_produk.csv"
dengan query sebagai berikut.

```
SELECT no_urut AS nomor, nama_produk AS nama FROM ms_produk;
```

In [ ]:
SELECT no_urut AS nomor, nama_produk AS nama FROM ms_produk;

##**2.8.Menggabungkan Prefix dan Alias**
```
SELECT ms_produk.harga AS harga_jual FROM ms_produk;
```

In [ ]:
SELECT ms_produk.harga AS harga_jual FROM ms_produk;

##**2.9. Menggunakan Alias pada Tabel**

```
SELECT * FROM ms_produk t2;
```

In [ ]:
SELECT * FROM ms_produk t2;

##**2.10. Prefix dengan Alias Tabel**

```
SELECT t2.nama_produk, t2.harga FROM ms_produk t2
```

In [ ]:
SELECT t2.nama_produk, t2.harga FROM ms_produk t2

##**2.11. Menggunakan WHERE**

```
SELECT * FROM ms_produk WHERE nama_produk='Tas Travel Organizer';
```

In [ ]:
SELECT * FROM ms_produk WHERE nama_produk='Tas Travel Organizer';

#**2.12. Menggunakan Operand OR**

```
SELECT * FROM ms_produk WHERE nama_produk='Gantungan Kunci' OR nama_produk='Tas Travel Organizer'OR nama_produk='Flashdisk 64 GB' ;
```

In [ ]:
SELECT * FROM ms_produk WHERE nama_produk='Gantungan Kunci' OR nama_produk='Tas Travel Organizer'OR nama_produk='Flashdisk 64 GB' ;

##**2.13. Filter untuk Angka**
```
SELECT * FROM ms_produk WHERE harga>50000;
```

In [ ]:
SELECT * FROM ms_produk WHERE harga>50000;

##**2.14. Menggunakan Operand AND**
```
SELECT * FROM ms_produk WHERE nama_produk='Gantungan Kunci' AND harga<50000;
```

In [ ]:
SELECT * FROM ms_produk WHERE nama_produk='Gantungan Kunci' AND harga<50000;

###**2.15. Proyek dari Cabang A**
Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/tr_penjualan.csv"
dengan query - query sebagai berikut.

```
SELECT kode_pelanggan, nama_produk, qty, harga, qty*harga AS total FROM tr_penjualan WHERE qty*harga>=100000 ORDER BY total DESC;```
```

In [ ]:
SELECT kode_pelanggan, nama_produk, qty, harga, qty*harga AS total FROM tr_penjualan WHERE qty*harga>=100000 ORDER BY total DESC;

#**3. Manipulasi Data Dengan Fungsi**

Fungsi dalam SQL adalah blok kode terstruktur yang melakukan tugas tertentu dan dapat dipanggil berkali-kali. Fungsi ini membantu menyederhanakan dan mengoptimalkan kueri SQL, serta memungkinkan penggunaan kembali kode

## **3.1. Fungsi Skalar Matematika - ABS()**

Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/students.csv"
dengan query sebagai berikut.

```
SELECT StudentID, FirstName, LastName, Semester1, Semester2, ABS(MarkGrowth) AS MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LastName, Semester1, Semester2, ABS(MarkGrowth) AS MarkGrowth
FROM students;

## **3.2. Fungsi Skalar Matematika - CEILING()**
Lakukan manipulasi data dari dataset pada tautan berikut:

"https://github.com/rahmadsa/dataset/blob/main/spark/students.csv"
dengan query - query sebagai berikut.

```
SELECT StudentID, FirstName, LastName, CEILING(Semester1) AS Semester1, CEILING(Semester2) AS Semester2,MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LastName, CEILING(Semester1) AS Semester1, CEILING(Semester2) AS Semester2,MarkGrowth
FROM students;

##**3.3. Fungsi Skalar Matematika - FLOOR()**

```
SELECT StudentID, FirstName, LastName, FLOOR(Semester1) AS Semester1, FLOOR(Semester2) AS Semester2, MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LastName, FLOOR(Semester1) AS Semester1, FLOOR(Semester2) AS Semester2, MarkGrowth
FROM students;

##**3.4. Fungsi Skalar Matematika - ROUND()**

```
SELECT StudentID, FirstName, LastName, ROUND(Semester1,1) AS Semester1, ROUND(Semester2,0) AS Semester2, MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LastName, ROUND(Semester1,1) AS Semester1, ROUND(Semester2,0) AS Semester2, MarkGrowth
FROM students;

##**3.5. Fungsi Skalar Matematika - SQRT( )**
```
SELECT StudentID, FirstName, LastName, SQRT(Semester1) AS Semester1, Semester2, MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LastName, SQRT(Semester1) AS Semester1, Semester2, MarkGrowth
FROM students;

##**3.6 Fungsi Text - CONCAT( )**
```
SELECT StudentID, CONCAT(FirstName, LastName) AS Name, Semester1, Semester2, MarkGrowth
FROM students;
```

In [ ]:
SELECT StudentID, CONCAT(FirstName, LastName) AS Name, Semester1, Semester2, MarkGrowth
FROM students;

##**3.7. Fungsi Text - SUBSTRING_INDEX( )**
```
SELECT StudentID, SUBSTRING_INDEX(Email, '@', 1) AS Name
FROM students;
```

In [ ]:
SELECT StudentID, SUBSTRING_INDEX(Email, '@', 1) AS Name
FROM students;

##**3.8. Fungsi Text - SUBSTR( )**
```
SELECT StudentID, SUBSTR(FirstName, 2, 3) AS Initial
FROM students;
```

In [ ]:
SELECT StudentID, SUBSTR(FirstName, 2, 3) AS Initial
FROM students;

## **3.9. Fungsi Text - LENGTH( )**
```
SELECT StudentID, FirstName, LENGTH(FirstName) AS Total_Char
FROM students;
```

In [ ]:
SELECT StudentID, FirstName, LENGTH(FirstName) AS Total_Char
FROM students;

##**3.10. Fungsi Text - REPLACE( )**
```
SELECT StudentID, Email, REPLACE(Email,'yahoo', 'gmail') AS New_Email
FROM students;
```

In [ ]:
SELECT StudentID, Email, REPLACE(Email,'yahoo', 'gmail') AS New_Email
FROM students;

## **3.11. Fungsi Aggregate - SUM()**
```
SELECT SUM(Semester1) AS Total_1, SUM(Semester2) AS Total_2
FROM students;
```

In [ ]:
SELECT SUM(Semester1) AS Total_1, SUM(Semester2) AS Total_2
FROM students;

## **3.12. Fungsi Aggregate - COUNT()**
```
SELECT COUNT(FirstName) AS Total_Student
FROM students;
```

In [ ]:
SELECT COUNT(FirstName) AS Total_Student
FROM students;

##**3.13. Fungsi Aggregate - AVG( )**
```
SELECT AVG(Semester1) AS AVG_1, AVG(Semester2) AS AVG_2
FROM students;
```

In [ ]:
SELECT AVG(Semester1) AS AVG_1, AVG(Semester2) AS AVG_2
FROM students;

##**3.14. Tugas Praktek-2.1**
```
SELECT StudentID, FirstName, LastName, MOD(Semester1,2) AS Semester1 , Semester2, EXP(MarkGrowth) FROM students;
```

In [ ]:
SELECT

## **3.15. Tugas Praktek-2.2**
```
SELECT StudentID, UPPER(FirstName) AS FirstName, LOWER(LastName) AS LastName FROM students;
```

In [ ]:
SELECT